---
kind: method
id: M:Autodesk.Revit.DB.Connector.IsConnectedTo(Autodesk.Revit.DB.Connector)
zh: 连接件、接口
source: html/75b99645-4c94-e9ac-9b2b-2017a5b8ce8a.htm
---
# Autodesk.Revit.DB.Connector.IsConnectedTo Method

**中文**: 连接件、接口

Identifies if the connector is connected to the specified connector.

## Syntax (C#)
```csharp
public bool IsConnectedTo(
	Connector connector
)
```

## Parameters
- **connector** (`Autodesk.Revit.DB.Connector`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the argument is Nothing nullptr a null reference ( Nothing in Visual Basic) .